rottenpotatoes/app/controllers/movies_controller.rb

  def director
      @movies = Movie.similar(params[:id])
      if !@movies
        movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]